# CAPSTONE PROJECT - PYTHON FUNDAMENTALS

In [16]:
#importing necessary libraries for the project 

import pandas as pd #importing pandas library with an alias of 'pd'
import numpy as np  #importing numpy library with an alias of 'np'

## Task 1 
#### There are three different tables as given above. Please make three dataframe in python and save them as three .csv files. 
#### From Task 2 to Task 10, use the saved .csv files only.

In [17]:
# creating project_dataframe_dictionary, later to be used to create dataframe. 
# Keys of dictionary refers to column names wheres the list of values as row details

project_dataframe_dictionary ={
    
    "ID":["A001", "A002", "A003", "A004", "A005", "A002",
              "A005", "A003", "A001", "A003", "A001", "A004", "A004", "A005"],
    
    "Project":["Project 1", "Project 2", "Project 3", "Project 4", "Project 5",
                    "Project 6", "Project 7", "Project 8", "Project 9", "Project 10",
                        "Project 11", "Project 12", "Project 13", "Project 14"],
    
    "Cost":[1002000, 2000000, 4500000, 5500000, np.nan, 680000, 400000, 
                350000, np.nan, 300000, 2000000, 1000000, 3000000, 200000], #np.nan signifies missing/undefined values
    
    "Status":["Finished", "Ongoing", "Finished", "Ongoing", "Finished" ,"Failed",
                  "Finished", "Failed", "Ongoing", "Finished", "Failed", "Ongoing",
                      "Finished", "Finished"] 
}

In [18]:
# creating employee_dataframe_dictionary, later to be used to create dataframe. 
# Keys of dictionary here, refers to column names wheres the list of values as row details

employee_dataframe_dictionary={

    "ID":["A001", "A002", "A003", "A004", "A005"],

    "Name":["John Alter", "Alice Luxumberg", "Tom Sabestine", "Nina Adgra", "Amy Johny"],

    "Gender": ["M", "F", "M", "F", "F"],

    "City": ["Paris", "London", "Berlin", "Newyork", "Madrid"],

    "Age": [25, 27, 29, 31, 30]
}

In [19]:
# creating seniority_dataframe_dictionary, later to be used to create dataframe. 
# Keys of dictionary here, refers to column names wheres the list of values as row details

seniority_dataframe_dictionary = {
    
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    
    "Designation Level": [2, 2, 3, 2, 3]
}

In [20]:
# Now, creating dataframes using the above dictionaries

project_dataframe = pd.DataFrame(project_dataframe_dictionary)

employee_dataframe = pd.DataFrame(employee_dataframe_dictionary) 

seniority_level_dataframe = pd.DataFrame(seniority_dataframe_dictionary)

In [21]:
# Now, saving the dataframes into three separate .csv files
# Setting index = False so that the DataFrame’s index is not written as an extra column in the CSV file.

project_dataframe.to_csv("project.csv", index = False) 

employee_dataframe.to_csv("employee.csv", index = False) 

seniority_level_dataframe.to_csv("seniority.csv", index = False)

## Task 2
#### The cost column in the dataframe “Project” has some missing values. Your task is to compute these missing values. 
#### Replace the missing values by running average. You should use the “For” loop for this task.

In [22]:
project_dataframe = pd.read_csv("project.csv") #reading the project.csv file and loading its contents into the dataframe

# Initializing counters for calculating the average Cost
count = 0  # Number of non-missing Cost values
total = 0  # Sum of non-missing Cost values

# looping through each row to calculate total and count of valid cost values
for i in range(len(project_dataframe)):
    
    if not pd.isna(project_dataframe.loc[i,"Cost"]): # checking if the cost value is not missing (NaN)
        count += 1
        total += project_dataframe.loc[i,"Cost"]

        
average = round(total/count,2) # calculating the average Cost and round it to 2 decimal places

# looping again to replace missing cost values with the calculated average
for i in range(len(project_dataframe)):
    
    # If cost is missing, replacing it with the average
    if pd.isna(project_dataframe.loc[i,"Cost"]):
        project_dataframe.loc[i,"Cost"] = average

# writing updated dataframe back to the csv file
project_dataframe.to_csv("project.csv",index=False) # Setting index = False so that the DataFrame’s index is not written as an extra column in the CSV file.

## Task 3
#### Split the name column in the Employee dataframe into two new columns “First Name” and “Last Name” and remove the older “name” column.

In [23]:
# loading the employee.csv file and loading its contents into the dataframe
employee_dataframe = pd.read_csv("employee.csv") 

# splitting the names and loading it in new columns, first name and last name
employee_dataframe[["First Name","Last Name"]] = employee_dataframe["Name"].str.split(' ',expand = True) 

# deleting the old "Name" column from the original dataframe as instructed
employee_dataframe.drop(["Name"], axis=1, inplace = True) 

# saving the updated dataframe back to csv file
# index=False prevents the dataframe index from being written as a column
employee_dataframe.to_csv("employee.csv", index=False)

## Task 4
#### Join all three dataframes in one single dataframe. Name it “Final”

In [24]:
#loading csv files into the respective dataframes
project_dataframe = pd.read_csv("project.csv")
employee_dataframe = pd.read_csv("employee.csv")
seniority_level_dataframe = pd.read_csv("seniority.csv")

#joning the three dataframes into one as "Final"
Final = employee_dataframe.merge(project_dataframe, on="ID", how="inner").merge(seniority_level_dataframe, on="ID", how="inner")

Final

,ID,Gender,City,Age,First Name,Last Name,Project,Cost,Status,Designation Level
0,A001,M,Paris,25,John,Alter,Project 1,1002000.00,Finished,2
1,A001,M,Paris,25,John,Alter,Project 9,1744333.33,Ongoing,2
2,A001,M,Paris,25,John,Alter,Project 11,2000000.00,Failed,2
3,A002,F,London,27,Alice,Luxumberg,Project 2,2000000.00,Ongoing,2
4,A002,F,London,27,Alice,Luxumberg,Project 6,680000.00,Failed,2
5,A003,M,Berlin,29,Tom,Sabestine,Project 3,4500000.00,Finished,3
6,A003,M,Berlin,29,Tom,Sabestine,Project 8,350000.00,Failed,3
7,A003,M,Berlin,29,Tom,Sabestine,Project 10,300000.00,Finished,3
8,A004,F,Newyork,31,Nina,Adgra,Project 4,5500000.00,Ongoing,2
9,A004,F,Newyork,31,Nina,Adgra,Project 12,1000000.00,Ongoing,2
10,A004,F,Newyork,31,Nina,Adgra,Project 13,3000000.00,Finished,2
11,A005,F,Madrid,30,Amy,Johny,Project 5,1744333.33,Finished,3
12,A005,F,Madrid,30,Amy,Johny,Project 7,400000.00,Finished,3
13,A005,F,Madrid,30,Amy,Johny,Project 14,200000.00,Finished,3

## Task 5
#### Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project cost only to employees who have finished the projects.

In [25]:
# assigning bonus based on project completion status
# if the project Status is 'Finished', assigning 5% of cost as bonus otherwise assigning 0.0
# also adding new column named Bonus

Final["Bonus"] = np.where(Final["Status"] == 'Finished',Final["Cost"]*0.05,0.0)

## Task 6
#### Demote the designation level by 1, whose projects have status “fail”. Delete the employees record whose designation level is above 4.

In [26]:
# demoting the designation level by 1 for employees whose project Status is 'Failed'
Final.loc[Final["Status"]=="Failed", "Designation Level"] += 1

# removing the employee record whose designation level is above 4
Final = Final.loc[Final["Designation Level"] <= 4]

## Task 7
#### Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [27]:
# adding "Mr." to the first name of male employees
Final.loc[Final["Gender"]=="M","First Name"] = "Mr. " + Final.loc[Final["Gender"] == "M", "First Name"]

# adding "Mrs. to the first name of female employees
Final.loc[Final["Gender"]=="F","First Name"] = "Mrs. " + Final.loc[Final["Gender"] == "F", "First Name"]

# deleting the gender column
Final.drop(["Gender"], axis = 1, inplace = True)

## Task 8
#### Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

In [ ]:
# updating  the 'Designation Level' column based on age using IF condition as instructed

Final["Designation Level"] = Final.apply(
    lambda x: x["Designation Level"] - 1      # promoting designation level by 1
    if x["Age"] > 29                          # if age greater than 29, promoting
    else x["Designation Level"],              # else keeping the same value
    axis=1                                   # applying the function row by row
)

Final

,ID,City,Age,First Name,Last Name,Project,Cost,Status,Designation Level,Bonus
0,A001,Paris,25,Mr. John,Alter,Project 1,1002000.00,Finished,2,50100.0000
1,A001,Paris,25,Mr. John,Alter,Project 9,1744333.33,Ongoing,2,0.0000
2,A001,Paris,25,Mr. John,Alter,Project 11,2000000.00,Failed,3,0.0000
3,A002,London,27,Mrs. Alice,Luxumberg,Project 2,2000000.00,Ongoing,2,0.0000
4,A002,London,27,Mrs. Alice,Luxumberg,Project 6,680000.00,Failed,3,0.0000
5,A003,Berlin,29,Mr. Tom,Sabestine,Project 3,4500000.00,Finished,3,225000.0000
6,A003,Berlin,29,Mr. Tom,Sabestine,Project 8,350000.00,Failed,4,0.0000
7,A003,Berlin,29,Mr. Tom,Sabestine,Project 10,300000.00,Finished,3,15000.0000
8,A004,Newyork,31,Mrs. Nina,Adgra,Project 4,5500000.00,Ongoing,1,0.0000
9,A004,Newyork,31,Mrs. Nina,Adgra,Project 12,1000000.00,Ongoing,1,0.0000
10,A004,Newyork,31,Mrs. Nina,Adgra,Project 13,3000000.00,Finished,1,150000.0000
11,A005,Madrid,30,Mrs. Amy,Johny,Project 5,1744333.33,Finished,2,87216.6665
12,A005,Madrid,30,Mrs. Amy,Johny,Project 7,400000.00,Finished,2,20000.0000
13,A005,Madrid,30,Mrs. Amy,Johny,Project 14,200000.00,Finished,2,10000.0000

## Task 9
#### Add the cost of all projects for each Employee and save it in new dataframe “TotalProjCost” with three columns ID, First Name, and Total cost

In [29]:
# grouping the dataframe by id and first name
# index = false makes sure that grouped columns remain as regular columns or else both columns would become multi-index
grouped = Final.groupby(["ID","First Name"], as_index = False)

TotalProjCost = grouped["Cost"].sum() #finding the sum of cost by grouped values for each ID–First Name combination

#renaming the columns as instructed 
TotalProjCost.columns = ['ID', 'First Name', 'Total Cost']

TotalProjCost

     ID  First Name  Total Cost
0  A001    Mr. John  4746333.33
1  A002  Mrs. Alice  2680000.00
2  A003     Mr. Tom  5150000.00
3  A004   Mrs. Nina  9500000.00
4  A005    Mrs. Amy  2344333.33

## Task 10
#### Print all the employee details whose city name contains the letter “o” in it.

In [30]:
# filtering final dataframe such that only the employee details 
# whose 'City' name contains the letter 'o' exist.
employee_details = Final[Final["City"].str.contains("o", case = False)]

# displaying the filtered dataframe as instructed
print(employee_details)

      ID     City  Age  First Name  Last Name     Project       Cost  \
3   A002   London   27  Mrs. Alice  Luxumberg   Project 2  2000000.0
4   A002   London   27  Mrs. Alice  Luxumberg   Project 6   680000.0
8   A004  Newyork   31   Mrs. Nina      Adgra   Project 4  5500000.0
9   A004  Newyork   31   Mrs. Nina      Adgra  Project 12  1000000.0
10  A004  Newyork   31   Mrs. Nina      Adgra  Project 13  3000000.0

      Status  Designation Level     Bonus
3    Ongoing                  2       0.0
4     Failed                  3       0.0
8    Ongoing                  1       0.0
9    Ongoing                  1       0.0
10  Finished                  1  150000.0